In [2]:
##check the working directory
import os
os.getcwd()
import pandas as pd
import numpy as np

In [3]:
#check working directory
os.getcwd()

'C:\\Users\\Aron'

In [4]:
df = pd.read_excel("excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

# Totals

Add a total column to calc total of Jan+Feb+Mar

Also add a total for each month by appending a totals data frame

In [5]:
df["total"] = df["Jan"] + df["Feb"] + df["Mar"]
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar,total
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000,107000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000,175000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000,246000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000,175000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000,317000

# Compute Some Totals

In [6]:
df["Jan"].sum(), df["Jan"].mean(),df["Jan"].min(),df["Jan"].max()

(1462000, 97466.666666666672, 10000, 162000)

In [7]:
sum_row=df[["Jan","Feb","Mar","total"]].sum()
sum_row

Jan      1462000
Feb      1507000
Mar       717000
total    3686000
dtype: int64

# Append this Data to the Data Fram

In [8]:
df_sum=pd.DataFrame(data=sum_row).T
df_sum
df_sum=df_sum.reindex(columns=df.columns)
df_sum
df_final=df.append(df_sum,ignore_index=True)
df_final.tail()

,account,name,street,city,state,postal-code,Jan,Feb,Mar,total
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000,322000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000,317000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000,210000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000,340000
15,NaN,NaN,NaN,NaN,NaN,NaN,1462000,1507000,717000,3686000

# Count Unique Occurences

In [9]:
from collections import Counter
myDict=Counter(df.state)
myDict

Counter({u'RhodeIsland': 2, u'Iowa': 2, u'Delaware': 1, u'NorthDakota': 1, u'Tenessee': 1, u'Pennsylvania': 1, u'NorthCarolina': 1, u'Mississipi': 1, u'California': 1, u'Idaho': 1, u'Arkansas': 1, u'Maine': 1, u'Texas': 1})

In [10]:
df['state'].unique

<bound method Series.unique of 0             Texas
1     NorthCarolina
2              Iowa
3             Maine
4        California
5          Arkansas
6        Mississipi
7       RhodeIsland
8      Pennsylvania
9             Idaho
10         Tenessee
11      NorthDakota
12             Iowa
13      RhodeIsland
14         Delaware
Name: state, dtype: object>

# Lets Perform a VLookup

Perform a VLookup by creating a lookup table and using the merge function to add a new lookup column

In [10]:
lu = pd.read_excel("Lookup.xlsx")
lu.head()

           State    Description
0          Texas        Tex Mex
1  NorthCarolina      Nod Cally
2           Iowa          Howya
3          Maine      Main Road
4     California  Cally Thistle

In [15]:

df1 = pd.merge(df,lu
               ,how='left', left_on='state', right_on='State')
df1.tail()

,account,name,street,city,state,postal-code,Jan,Feb,Mar,total,State,Description
10,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000,200000,Pennsylvania,Penny V
11,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000,225000,Idaho,you da Hoe
12,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000,220000,Tenessee,Ten Seas
13,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000,322000,NaN,NaN
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000,340000,NaN,NaN

# Sumifs

-Sumif the spend in Jan > 69999

-Do this by adding a new column that populates the cell using and if statement(lambda). The calculate sum of column

-Also count number of rows that satisfy this statement using a subset method

In [39]:
df1['matches'] = df1.apply(lambda x: x['total'] if x['Jan'] > 69999 else 0,  axis=1)
df1.matches.sum()

2722000

In [38]:
df1_subset = df1[(df1.Jan > 69999)]
df1_subset.matches.count()

10